# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 with MobileNetV4 backbone + BiFPN head
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33
width_multiple: 0.25
max_channels: 1024

# MobileNetV4 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileNetV4, [32, 1]]   # 0-P1/2  320x320
  - [-1, 1, MobileNetV4, [48, 2]]   # 1-P2/4 160x160
  - [-1, 1, MobileNetV4, [80, 3]]   # 2-P3/8 80x80
  - [-1, 1, MobileNetV4, [160, 4]]  # 3-P4/16 40x40
  - [-1, 1, MobileNetV4, [960, 5]]  # 4-P5/32 20x20

# BiFPN enhanced head
head:
  # ------------------- P5 -> P4 -------------------
  - [-1, 1, Conv, [512, 1, 1]]                    # 5-P5 adaptor (960->512)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 6 (20x20->40x40)
  - [[-1, 3], 1, BiFPN_Add2, [256, 256]]          # 7 输入应为[512, 160]
  - [-1, 3, C2f, [512]]                           # 8

  # ------------------- P4 -> P3 -------------------
  - [-1, 1, Conv, [256, 1, 1]]                    # 9-P4 adaptor (160->256)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]     # 10 (40x40->80x80)
  - [[-1, 2], 1, BiFPN_Add2, [128, 128]]          # 11 输入应为[256, 80]
  - [-1, 3, C2f, [256]]                           # 12 (P3/8-small)

  # ------------------- P3 -> P4 -------------------
  - [-1, 1, Conv, [256, 3, 2]]                    # 13 (80x80->40x40)
  - [[-1, 8, 3], 1, BiFPN_Add3, [256, 256]]       # 14 输入应为[256, 512, 160]
  - [-1, 3, C2f, [512]]                           # 15 (P4/16-medium)

  # ------------------- P4 -> P5 -------------------
  - [-1, 1, Conv, [512, 3, 2]]                    # 16 (40x40->20x20)
  - [[-1, 5], 1, BiFPN_Add2, [512, 512]]          # 17 输入应为[512, 960]
  - [-1, 3, C2f, [1024]]                          # 18 (P5/32-large)
  # ------------------- Detect ---------------------
  - [[12, 15, 18], 1, Detect, [nc]]  # Detect(P3, P4, P5)