# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33
width_multiple: 0.25
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostNetV3, [8, 1]]     # 0-P1/2
  - [-1, 1, GhostNetV3, [12, 2]]    # 1-P2/3
  - [-1, 1, GhostNetV3, [20, 3]]    # 2-P3/8
  - [-1, 1, GhostNetV3, [56, 4]]    # 3-P4/16
  - [-1, 1, GhostNetV3, [480, 5]]   # 4-P5/32

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[10, 13, 16], 1, Detect, [nc]]