# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33
width_multiple: 0.25
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2      # 实际特征图输出大小变为：320 * 320
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4     # 实际特征图输出大小变为：160 * 160
  - [-1, 3, C2f, [128, True]]                # 实际特征图输出大小变为：160 * 160
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8     # 实际特征图输出大小变为：80 * 80
  - [-1, 6, C2f, [256, True]]   # 4          # 实际特征图输出大小变为：80 * 80
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16    # 实际特征图输出大小变为：40 * 40
  - [-1, 6, C2f, [512, True]]   # 6          # 实际特征图输出大小变为：40 * 40
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32   # 实际特征图输出大小变为：20 * 20
  - [-1, 3, C2f, [1024, True]]               # 实际特征图输出大小变为：20 * 20
  - [-1, 1, SPPF, [1024, 5]]  # 9            # 实际特征图输出大小变为：20 * 20



#head:
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       # 上采样实际特征图输出大小变为：40 * 40
#  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4     # 实际特征图输出大小变为：40 * 40
#  - [-1, 3, C2f, [512]]  # 12                        # 实际特征图输出大小变为：40 * 40
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]       # 上采样实际特征图输出大小变为：80 * 80
#  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3     # 实际特征图输出大小变为：80 * 80
#  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)           # 实际特征图输出大小变为：80 * 80
#
#  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 上采样实际特征图输出大小变为：160 * 160
#  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3      # 实际特征图输出大小变为：160 * 160
#  - [-1, 3, C2f, [128]]  # 18 (P3/8-small)            # 实际特征图输出大小变为：160 * 160
#
#
#  - [ -1, 1, Conv, [128, 3, 2] ]                       # 实际特征图输出大小变为：80 * 80
#  - [ [ -1, 15 ], 1, Concat, [1]]  # cat head P4       # 实际特征图输出大小变为：80 * 80
#  - [ -1, 3, C2f, [256] ]  # 22 (P4/16-medium)         # 实际特征图输出大小变为：80 * 80
#
#
#  - [-1, 1, Conv, [256, 3, 2]]                         # 实际特征图输出大小变为：40 * 40
#  - [[-1, 12], 1, Concat, [1]]  # cat head P4          # 实际特征图输出大小变为：40 * 40
#  - [-1, 3, C2f, [512]]  # 26 (P4/16-medium)           # 实际特征图输出大小变为：40 * 40
#
#
#  - [-1, 1, Conv, [512, 3, 2]]                         # 实际特征图输出大小变为：20 * 20
#  - [[-1, 9], 1, Concat, [1]]  # cat head P5           # 实际特征图输出大小变为：20 * 20
#  - [-1, 3, C2f, [1024]]  # 30 (P5/32-large)           # 实际特征图输出大小变为：20 * 20
#
#
#  - [[18, 21, 24,27], 1, ASFF_Detect, [nc]]  # Detect(P3, P4, P5)


head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      # 上采样实际特征图输出大小变为：40 * 40
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4    # 实际特征图输出大小变为：40 * 40
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]      # 上采样实际特征图输出大小变为：80 * 80
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3    # 实际特征图输出大小变为：80 * 80
  - [-1, 3, C2f, [512]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                      # 下采样实际特征图输出大小变为：40 * 40
  - [[-1, 12], 1, Concat, [1]]  # cat head P4       # 实际特征图输出大小变为：40 * 40
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                      # 下采样实际特征图输出大小变为：20 * 20
  - [[-1, 9], 1, Concat, [1]]  # cat head P5        # 实际特征图输出大小变为：20 * 20
  - [-1, 3, C2f, [512]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, DetectDynamicHead, [nc]]  # Detect(P3, P4, P5)