# Ultralytics YOLO 🚀, AGPL-3.0 license
# Combined YOLOv8 model: ShuffleNetV2 backbone + BiFPN head

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33
width_multiple: 0.25
max_channels: 1024

# Lightweight ShuffleNetV2 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ShuffleNetV2, [24, 1]]     # 0-P1/2 -> 320x320
  - [-1, 1, ShuffleNetV2, [24, 2]]     # 1-P2/3 -> 160x160
  - [-1, 1, ShuffleNetV2, [116, 3]]    # 2-P3/8 -> 80x80
  - [-1, 1, ShuffleNetV2, [232, 4]]    # 3-P4/16 -> 40x40
  - [-1, 1, ShuffleNetV2, [1024, 5]]   # 4-P5/32 -> 20x20

# BiFPN-enhanced head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, BiFPN_Add2, [128, 128]]  # fuse with P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, BiFPN_Add2, [64, 64]]  # fuse with P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12, 3], 1, BiFPN_Add3, [128, 128]]  # fuse with P4
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, BiFPN_Add2, [128, 128]]  # fuse with P5
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)